app/controllers/guess_controller.rb

INSERT INTO "guesses" ("height", "weight", "likes", "confirmed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["height", 70], ["weight", 140], ["likes", "Cats"], ["confirmed", false], ["created_at", 2017-01-05 04:49:58 UTC], ["updated_at", 2017-01-05 04:49:58 UTC]]
---
  def submit
  	height = params[:height]
    weight = params[:weight]

    # validate both values passed in
    if (height.blank? || weight.blank?)
    	logger.error "Height and weight required"
      return render plain: "Height and weight are required!", status: :bad_request
    end

    # validate both values positive integers
    if (!GuessHelper.is_positive_integer?(height) || !GuessHelper.is_positive_integer?(weight))
    	logger.error "Height and weight must be positive integers"
    	return render plain: "Height and weight must be positive numbers!", status: :bad_request
    end

    # create a new guess record
    guess = Guess.new(height: height.to_i, weight: weight.to_i, confirmed: false)

    # run the algorithm to compute the likes field
    GuessHelper.generate_likes(guess)

    # persist the record to the database
    guess.save