app/controllers/guess_controller.rb

INSERT INTO "guesses" ("height", "weight", "likes", "confirmed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["height", 70], ["weight", 140], ["likes", "Cats"], ["confirmed", false], ["created_at", 2017-01-05 19:53:31 UTC], ["updated_at", 2017-01-05 19:53:31 UTC]]
---
    GuessHelper.generate_likes(@guess)

    # persist ithe record to the database
    @guess.save

SELECT  "guesses".* FROM "guesses" WHERE "guesses"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "guesses" SET "confirmed" = ?, "updated_at" = ? WHERE "guesses"."id" = ?  [["confirmed", true], ["updated_at", 2017-01-05 07:03:08 UTC], ["id", 30]]
---
  def do_confirm
    guess_id = params[:guess_id]

    # get the Guess in the database with that id
    guess = Guess.find(guess_id)

    # update the confirmed value
    if (params[:correct])
      guess.confirmed = true
    elsif (params[:incorrect])
      guess.confirmed = false
    else
      logger.error "Expected either correct or incorrect!"
    end

    # save it
    guess.save